floating/nurion/foamMooring/tutorial/sixDoF_2D/overset/background/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    oversetPatch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          140;
        startFace       160738;
    }
    stationaryWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1000;
        startFace       160878;
    }
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       161878;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       161958;
    }
    sidePatch
    {
        type            empty;
        inGroups        1(empty);
        nFaces          160000;
        startFace       162038;
    }
    atmosphere
    {
        type            patch;
        nFaces          1000;
        startFace       322038;
    }
    sidePatch1
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1920;
        startFace       323038;
    }
    floatingObject
    {
        type            wall;
        inGroups        1(wall);
        nFaces          64;
        startFace       324958;
    }
)

// ************************************************************************* //
